---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.GetGreen
source: html/9183068d-59f8-f1c6-28b1-724efbc6a430.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.GetGreen Method

get green

## Syntax (C#)
```csharp
public uint GetGreen()
```

## Returns
green